<script setup>
import { useCounterStore } from '@/stores/store'
const store = useCounterStore()
</script>

<template>
<main>
<div class="container text-center">
  <div class="row row-cols-lg-3 row-cols-md-2 row-cols-sm-1">
    <div class="col">
      <img src="{{ store.sewingimages[0].fimage }}">
    </div>
    <div class="col">
      <p>От 10 лет - шьем одежду для себя - свитшоты, футболки, топы, шорты.
Работаем с готовыми выкройками, учимся правильно раскладывать детали на ткани, выкраивать, работаем с оверлоком, швейной машиной, парогенератором. 
И в результате ребёнок уходит в готовом изделии, сшитом своими руками! 
Запишите ребёнка на занятия и вы удивитесь, что ваш ребёнок умеет!</p>
    </div>
    <div class="col">
      <img src="{{ store.sewingimages[1].fimage }}">
    </div>
  </div>
  <div class="row row-cols-lg-3 row-cols-md-2 row-cols-sm-1">
    <div class="col">
      <p>Возраст от 7 лет "Домики из фетра"
Творческие занятия для самых маленьких учеников - придумываем свой домик, подбираем сочетание цветов, конструируем мебель, учимся раскраивать. И, главное, работаем на швейной машинке! 
За одно занятие  делаем одну комнату.
Запишите ребёнка на занятие и вы удивитесь, что умеет ваш ребёнок!</p>
    </div>
    <div class="col">
      <img src="{{ store.sewingimages[2].fimage }}">
    </div>
    <div class="col">
      <p>От 14 лет - изготовление изделия начинается с построения выкройки по своим меркам, учимся правильно раскладывать детали на ткани, кроить, работаем с оверлоком, швейной машинкой, парогенератором. 
И в результате подросток шьет изделие, построенное по собственной выкройке!</p>
    </div>
  </div>
</div>

</main>
</template>