

<template>
<p>Чем полезны занятия вязанием и шитьем?</p>
<ul>
    <li>Развитие креативного мышления, воображения, умения находить нестандартные решения.</li>
    <li>Развитие пространственного мышления, восприятия форм.</li>
    <li>Улучшение концентрации, тренировка внимательности и усидчивости.</li>
    <li>Формирование умения довести дело до конца.</li>
    <li>Помощь в видении связей между деталями и целым.</li>
    <li>Развитие уверенности в себе.</li>
    <li>Улучшение эмоционального состояния, снятие стресса.</li>
</ul>
</template>